region_config = [
    {
        "name": "动画",
        "list": [24, 25, 47, 210, 86, 27]
    },
    {
        "name": "音乐",
        "list": [28, 31, 30, 194, 59, 193, 29, 130]
    },
    {
        "name": "游戏",
        "list": [17, 171, 172, 65, 173, 121, 136, 19]
    },
    {
        "name": "知识",
        "list": [201, 124, 228, 207, 208, 209, 229, 122]
    },
    {
        "name": "美食",
        "list": [76, 212, 213, 214, 215]
    },
    {
        "name": "资讯",
        "list": [203, 204, 205, 206]
    },
    {
        "name": "生活",
        "list": [138, 239, 161, 162, 21]
    }
]


tid = {
    "24": "1",
    "25": "1",
    "27": "1",
    "47": "1",
    "86": "1",
    "210": "1",
    "28": "3",
    "29": "3",
    "30": "3",
    "31": "3",
    "59": "3",
    "130": "3",
    "193": "3",
    "194": "3",
    "17": "4",
    "19": "4",
    "65": "4",
    "121": "4",
    "136": "4",
    "171": "4",
    "172": "4",
    "173": "4",
    "71": "5",
    "137": "5",
    "11": "5",
    "185": "5",
    "187": "5",
    "32": "13",
    "33": "13",
    "51": "13",
    "152": "13",
    "83": "23",
    "145": "23",
    "146": "23",
    "147": "23",
    "122": "36",
    "124": "36",
    "201": "36",
    "207": "36",
    "208": "36",
    "209": "36",
    "228": "36",
    "229": "36",
    "22": "119",
    "26": "119",
    "126": "119",
    "127": "119",
    "216": "119",
    "20": "129",
    "154": "129",
    "156": "129",
    "198": "129",
    "199": "129",
    "200": "129",
    "157": "155",
    "158": "155",
    "159": "155",
    "192": "155",
    "21": "160",
    "138": "160",
    "161": "160",
    "162": "160",
    "239": "160",
    "153": "167",
    "168": "167",
    "169": "167",
    "170": "167",
    "195": "167",
    "37": "177",
    "178": "177",
    "179": "177",
    "180": "177",
    "85": "181",
    "182": "181",
    "183": "181",
    "184": "181",
    "95": "188",
    "230": "188",
    "231": "188",
    "232": "188",
    "233": "188",
    "76": "211",
    "212": "211",
    "213": "211",
    "214": "211",
    "215": "211",
    "75": "217",
    "218": "217",
    "219": "217",
    "220": "217",
    "221": "217",
    "222": "217",
    "176": "223",
    "224": "223",
    "225": "223",
    "226": "223",
    "227": "223",
    "164": "234",
    "235": "234",
    "236": "234",
    "237": "234",
    "238": "234",
    "203": "202",
    "204": "202",
    "205": "202",
    "206": "202"
}

region_info = {
    "160": {
        "name": "生活",
        "parent": 0,
        "desc": "生活"
    },
    "138": {
        "name": "搞笑",
        "parent": 160,
        "desc": "搞笑挑战、剪辑、表演、配音以及各类日常沙雕视频"
    },
    "239": {
        "name": "家居房产",
        "parent": 160,
        "desc": "与买房、装修、居家生活相关的视频，如买房租房、装修改造、智能家居、园艺绿植、居家好物等"
    },
    "161": {
        "name": "手工",
        "parent": 160,
        "desc": "简易手工艺品的diy制作视频，例如；折纸、手账、橡皮章等"
    },
    "162": {
        "name": "绘画",
        "parent": 160,
        "desc": "绘画爱好者们关于绘画技巧、绘图过程的分享交流场所"
    },
    "21": {
        "name": "日常",
        "parent": 160,
        "desc": "一般日常向的生活类视频"
    },
    "4": {
        "name": "游戏",
        "parent": 0,
        "desc": "游戏"
    },
    "17": {
        "name": "单机游戏",
        "parent": 4,
        "desc": "以单机或其联机模式为主要内容的相关视频"
    },
    "65": {
        "name": "网络游戏",
        "parent": 4,
        "desc": "多人在线游戏为主要内容的相关视频"
    },
    "172": {
        "name": "手机游戏",
        "parent": 4,
        "desc": "手机及平板设备平台上的游戏相关视频"
    },
    "171": {
        "name": "电子竞技",
        "parent": 4,
        "desc": "电子竞技游戏项目为主要内容的相关视频"
    },
    "173": {
        "name": "桌游棋牌",
        "parent": 4,
        "desc": "桌游、棋牌、卡牌、聚会游戏等相关视频"
    },
    "136": {
        "name": "音游",
        "parent": 4,
        "desc": "通过配合音乐与节奏而进行的音乐类游戏视频"
    },
    "121": {
        "name": "GMV",
        "parent": 4,
        "desc": "使用游戏内容或CG为素材制作的MV类型的视频"
    },
    "19": {
        "name": "Mugen",
        "parent": 4,
        "desc": "使用Mugen引擎制作或与Mugen相关的游戏视频"
    },
    "5": {
        "name": "娱乐",
        "parent": 0,
        "desc": "娱乐"
    },
    "71": {
        "name": "综艺",
        "parent": 5,
        "desc": "所有综艺相关，全部一手掌握！"
    },
    "241": {
        "name": "娱乐杂谈",
        "parent": 5,
        "desc": "娱乐人物解读、娱乐热点点评、娱乐行业分析"
    },
    "242": {
        "name": "粉丝创作",
        "parent": 5,
        "desc": "粉丝向创作视频"
    },
    "137": {
        "name": "明星综合",
        "parent": 5,
        "desc": "娱乐圈动态、明星资讯相关"
    },
    "36": {
        "name": "知识",
        "parent": 0,
        "desc": "知识"
    },
    "201": {
        "name": "科学科普",
        "parent": 36,
        "desc": "以自然科学或基于自然科学思维展开的知识视频"
    },
    "124": {
        "name": "社科·法律·心理",
        "parent": 36,
        "desc": "法律/心理/社会学/观点输出类内容等"
    },
    "228": {
        "name": "人文历史",
        "parent": 36,
        "desc": "人物/文学/历史/文化/奇闻/艺术等"
    },
    "207": {
        "name": "财经商业",
        "parent": 36,
        "desc": "财经/商业/经济金融/互联网等"
    },
    "208": {
        "name": "校园学习",
        "parent": 36,
        "desc": "学习方法及经验、课程教学、校园干货分享等"
    },
    "209": {
        "name": "职业职场",
        "parent": 36,
        "desc": "职场技能、职业分享、行业分析、求职规划等"
    },
    "229": {
        "name": "设计·创意",
        "parent": 36,
        "desc": "以设计美学或基于设计思维展开的知识视频"
    },
    "122": {
        "name": "野生技能协会",
        "parent": 36,
        "desc": "技能展示或技能教学分享类视频"
    },
    "181": {
        "name": "影视",
        "parent": 0,
        "desc": "影视"
    },
    "85": {
        "name": "短片",
        "parent": 181,
        "desc": "具有一定故事线的剧情短片或者追求印象诗意化的实验短片"
    },
    "182": {
        "name": "影视杂谈",
        "parent": 181,
        "desc": "影视评论、解说、吐槽、科普、配音等"
    },
    "183": {
        "name": "影视剪辑",
        "parent": 181,
        "desc": "对影视素材进行剪辑再创作的视频"
    },
    "184": {
        "name": "预告·资讯",
        "parent": 181,
        "desc": "影视类相关资讯，预告，花絮等视频"
    },
    "3": {
        "name": "音乐",
        "parent": 0,
        "desc": "音乐"
    },
    "130": {
        "name": "音乐综合",
        "parent": 3,
        "desc": "收录无法定义到其他音乐子分区的音乐视频。"
    },
    "29": {
        "name": "音乐现场",
        "parent": 3,
        "desc": "音乐实况表演视频"
    },
    "59": {
        "name": "演奏",
        "parent": 3,
        "desc": "使用各种传统及非传统乐器进行演奏创作"
    },
    "31": {
        "name": "翻唱",
        "parent": 3,
        "desc": "非官方性质的人声歌曲演绎"
    },
    "193": {
        "name": "MV",
        "parent": 3,
        "desc": "音乐录影带，官方为搭配音乐而拍摄的短片。"
    },
    "30": {
        "name": "VOCALOID·UTAU",
        "parent": 3,
        "desc": "以Vocaloid及UTAU引擎环境为主，运用各种音源进行创作"
    },
    "194": {
        "name": "电音",
        "parent": 3,
        "desc": "以电子合成器、音乐软体等产生的电子声响制作的音乐。"
    },
    "28": {
        "name": "原创音乐",
        "parent": 3,
        "desc": "由上传者本人参与创作制作或原作者授权代投的歌曲及纯音乐"
    },
    "1": {
        "name": "动画",
        "parent": 0,
        "desc": "动画"
    },
    "24": {
        "name": "MAD·AMV",
        "parent": 1,
        "desc": "具有一定创作度的动/静画二次创作视频"
    },
    "25": {
        "name": "MMD·3D",
        "parent": 1,
        "desc": "使用MMD和其他3D软件制作的视频"
    },
    "27": {
        "name": "综合",
        "parent": 1,
        "desc": "以动画及相关内容为素材的创作"
    },
    "47": {
        "name": "短片·手书·配音",
        "parent": 1,
        "desc": "颇具特色的短片/手书及ACG相关配音"
    },
    "210": {
        "name": "手办·模玩",
        "parent": 1,
        "desc": "手办模玩的测评、改造或其他衍生内容"
    },
    "86": {
        "name": "特摄",
        "parent": 1,
        "desc": "特摄相关衍生视频"
    },
    "155": {
        "name": "时尚",
        "parent": 0,
        "desc": "时尚"
    },
    "157": {
        "name": "美妆护肤",
        "parent": 155,
        "desc": "彩妆护肤、发型美甲、仿妆、美容美体、口腔、拍照技巧、颜值分析等变美相关内容分享或产品测评"
    },
    "158": {
        "name": "穿搭",
        "parent": 155,
        "desc": "穿搭风格、穿搭技巧的展示分享，涵盖衣服、鞋靴、箱包配件、配饰（帽子、钟表、珠宝首饰）等"
    },
    "159": {
        "name": "时尚潮流",
        "parent": 155,
        "desc": "时尚街拍、时装周、时尚大片，时尚品牌、潮流等行业相关记录及知识科普"
    },
    "211": {
        "name": "美食",
        "parent": 0,
        "desc": "美食"
    },
    "76": {
        "name": "美食制作",
        "parent": 211,
        "desc": "包括但不限于料理制作教程，各种菜系、甜点、速食、饮料、小吃制作等"
    },
    "212": {
        "name": "美食侦探",
        "parent": 211,
        "desc": "包括但不限于探店、街边美食、饮食文化，发现特色地域美食、路边摊与热门网红食物等"
    },
    "213": {
        "name": "美食测评",
        "parent": 211,
        "desc": "包括但不限于边吃边聊、测评推荐或吐槽各种美食等"
    },
    "214": {
        "name": "田园美食",
        "parent": 211,
        "desc": "包括但不限于乡野美食、三农采摘、钓鱼赶海等"
    },
    "215": {
        "name": "美食记录",
        "parent": 211,
        "desc": "记录一日三餐，美食vlog、料理、便当、饮品合集、美食小剧场等"
    },
    "223": {
        "name": "汽车",
        "parent": 0,
        "desc": "汽车"
    },
    "176": {
        "name": "汽车生活",
        "parent": 223,
        "desc": "和汽车等交通工具相关的一切泛化内容的视频"
    },
    "224": {
        "name": "汽车文化",
        "parent": 223,
        "desc": "和汽车文化相关的视频"
    },
    "245": {
        "name": "赛车",
        "parent": 223,
        "desc": "一切以汽车运动为代表的车手、汽车赛事、赛道、赛车模拟器、赛车、卡丁车及赛车衍生品相关的视频"
    },
    "225": {
        "name": "汽车极客",
        "parent": 223,
        "desc": "热衷于汽车技术及运用汽车技术实践的汽车发烧友"
    },
    "240": {
        "name": "摩托车",
        "parent": 223,
        "desc": "与摩托车相关的视频，包括但不限于摩托车骑行、试驾、装备测评、教学、赛事、剪辑等相关内容"
    },
    "226": {
        "name": "智能出行",
        "parent": 223,
        "desc": "和新能源汽车及新出行方式相关的视频"
    },
    "227": {
        "name": "购车攻略",
        "parent": 223,
        "desc": "新车、二手车测评试驾，购车推荐，交易避坑攻略等"
    },
    "234": {
        "name": "运动",
        "parent": 0,
        "desc": "运动"
    },
    "235": {
        "name": "篮球·足球",
        "parent": 234,
        "desc": "与篮球、足球相关的视频，包括但不限于篮足球赛事、教学、评述、剪辑、剧情等相关内容"
    },
    "164": {
        "name": "健身",
        "parent": 234,
        "desc": "与健身相关的视频，包括但不限于健身、健美、操舞、瑜伽、普拉提、跑步、街健、健康餐、健身小剧场等内容"
    },
    "236": {
        "name": "竞技体育",
        "parent": 234,
        "desc": "与竞技体育相关的视频，包括但不限于乒乓、羽毛球、排球、赛车等竞技项目的赛事、评述、剪辑、剧情等相关内容"
    },
    "237": {
        "name": "运动文化",
        "parent": 234,
        "desc": "与运动文化相关的视频，包括但不限于球鞋、球衣、球星卡等运动衍生品的分享、解读，体育产业的分析、科普等相关内容"
    },
    "238": {
        "name": "运动综合",
        "parent": 234,
        "desc": "与运动综合相关的视频，包括但不限于钓鱼、骑行、滑板等日常运动分享、教学、Vlog等相关内容"
    },
    "188": {
        "name": "科技",
        "parent": 0,
        "desc": "科技"
    },
    "95": {
        "name": "数码",
        "parent": 188,
        "desc": "手机/电脑/相机/影音智能设备等"
    },
    "230": {
        "name": "软件应用",
        "parent": 188,
        "desc": "围绕各类系统软件、应用软件、网站的相关视频"
    },
    "231": {
        "name": "计算机技术",
        "parent": 188,
        "desc": "软硬件开发/人工智能/大数据/深度学习/IT运维等"
    },
    "232": {
        "name": "科工机械",
        "parent": 188,
        "desc": "航空航天/工程建设/电子工程/机械制造/海洋工程等"
    },
    "233": {
        "name": "极客DIY",
        "parent": 188,
        "desc": "硬核制作/发明创造/技术创新/极客文化等"
    },
    "217": {
        "name": "动物圈",
        "parent": 0,
        "desc": "动物圈"
    },
    "218": {
        "name": "喵星人",
        "parent": 217,
        "desc": "与猫相关的视频，包括但不限于猫咪日常、猫咪喂养、猫咪知识、猫咪剧场、猫咪救助、猫咪娱乐相关的内容"
    },
    "219": {
        "name": "汪星人",
        "parent": 217,
        "desc": "与狗相关的视频，包括但不限于狗狗日常、狗狗喂养、狗狗知识、狗狗剧场、狗狗救助、狗狗娱乐相关的内容"
    },
    "221": {
        "name": "野生动物",
        "parent": 217,
        "desc": "与野生动物相关的视频，包括但不限于狮子、老虎、狼等动物内容"
    },
    "222": {
        "name": "爬宠",
        "parent": 217,
        "desc": "与爬宠相关的视频，包括但不限于龟、蜘蛛、蜥蜴等以宠物方式养育的爬行类动物内容 "
    },
    "220": {
        "name": "大熊猫",
        "parent": 217,
        "desc": "与大熊猫相关的视频，包括但不限于熊猫日常、熊猫喂养、熊猫知识、熊猫剧场、熊猫救助、熊猫娱乐相关的内容"
    },
    "75": {
        "name": "动物综合",
        "parent": 217,
        "desc": "除喵星人、汪星人、大熊猫、爬宠、野生动物之外的其余动物相关视频以及动物相关的延伸内容"
    },
    "129": {
        "name": "舞蹈",
        "parent": 0,
        "desc": "舞蹈"
    },
    "20": {
        "name": "宅舞",
        "parent": 129,
        "desc": "与ACG相关的翻跳、原创舞蹈"
    },
    "154": {
        "name": "舞蹈综合",
        "parent": 129,
        "desc": "收录无法定义到其他舞蹈子分区的舞蹈视频"
    },
    "156": {
        "name": "舞蹈教程",
        "parent": 129,
        "desc": "动作分解，基础教程等具有教学意义的舞蹈视频"
    },
    "198": {
        "name": "街舞",
        "parent": 129,
        "desc": "收录街舞相关内容，包括赛事现场、舞室作品、个人翻跳、FREESTYLE等"
    },
    "199": {
        "name": "明星舞蹈",
        "parent": 129,
        "desc": "国内外明星发布的官方舞蹈及其翻跳内容"
    },
    "200": {
        "name": "中国舞",
        "parent": 129,
        "desc": "传承中国艺术文化的舞蹈内容，包括古典舞、民族民间舞、汉唐舞、古风舞等"
    },
    "167": {
        "name": "国创",
        "parent": 0,
        "desc": "国创"
    },
    "153": {
        "name": "国产动画",
        "parent": 167,
        "desc": "国产连载动画，国产完结动画"
    },
    "168": {
        "name": "国产原创相关",
        "parent": 167,
        "desc": "以国产动画、漫画、小说为素材的二次创作"
    },
    "169": {
        "name": "布袋戏",
        "parent": 167,
        "desc": "布袋戏以及相关剪辑节目"
    },
    "170": {
        "name": "资讯",
        "parent": 167,
        "desc": "原创国产动画、漫画的相关资讯、宣传节目等"
    },
    "195": {
        "name": "动态漫·广播剧",
        "parent": 167,
        "desc": "国产动态漫画、有声漫画、广播剧"
    },
    "119": {
        "name": "鬼畜",
        "parent": 0,
        "desc": "鬼畜"
    },
    "22": {
        "name": "鬼畜调教",
        "parent": 119,
        "desc": "使用素材在音频、画面上做一定处理，达到与BGM具有一定同步感的视频"
    },
    "26": {
        "name": "音MAD",
        "parent": 119,
        "desc": "使用素材音频进行一定的二次创作来达到还原原曲的非商业性质稿件"
    },
    "126": {
        "name": "人力VOCALOID",
        "parent": 119,
        "desc": "将人物或者角色的无伴奏素材进行人工调音，使其就像VOCALOID一样歌唱的技术"
    },
    "216": {
        "name": "鬼畜剧场",
        "parent": 119,
        "desc": "使用素材进行人工剪辑编排的有剧情的视频"
    },
    "127": {
        "name": "教程演示",
        "parent": 119,
        "desc": "鬼畜相关的科普和教程演示"
    },
    "177": {
        "name": "纪录片",
        "parent": 0,
        "desc": "非电影性质的完整纪录片"
    },
    "37": {
        "name": "人文·历史",
        "parent": 177,
        "desc": "除宣传片、影视剪辑外的，人文艺术历史纪录剧集或电影、预告、花絮、二创、5分钟以上纪录短片"
    },
    "178": {
        "name": "科学·探索·自然",
        "parent": 177,
        "desc": "除演讲、网课、教程外的，科学探索自然纪录剧集或电影、预告、花絮、二创、5分钟以上纪录短片"
    },
    "179": {
        "name": "军事",
        "parent": 177,
        "desc": "除时政军事新闻外的，军事纪录剧集或电影、预告、花絮、二创、5分钟以上纪录短片"
    },
    "180": {
        "name": "社会·美食·旅行",
        "parent": 177,
        "desc": "除VLOG、风光摄影外的，社会美食旅行纪录剧集或电影、预告、花絮、二创、5分钟以上纪录短片"
    },
    "13": {
        "name": "番剧",
        "parent": 0,
        "desc": "番剧"
    },
    "51": {
        "name": "资讯",
        "parent": 13,
        "desc": "以动画/轻小说/漫画/杂志为主的资讯内容，PV/CM/特报/冒头/映像/预告"
    },
    "152": {
        "name": "官方延伸",
        "parent": 13,
        "desc": "以动画番剧及声优为主的EVENT/生放送/DRAMA/RADIO/LIVE/特典/冒头等"
    },
    "32": {
        "name": "完结动画",
        "parent": 13,
        "desc": "已完结TV/WEB动画及其独立系列，旧剧场版/OVA/SP/未放送"
    },
    "33": {
        "name": "连载动画",
        "parent": 13,
        "desc": "连载中TV/WEB动画，新剧场版/OVA/SP/未放送/小剧场"
    },
    "11": {
        "name": "电视剧",
        "parent": 0,
        "desc": "电视剧"
    },
    "185": {
        "name": "国产剧",
        "parent": 11,
        "desc": ""
    },
    "187": {
        "name": "海外剧",
        "parent": 11,
        "desc": ""
    },
    "23": {
        "name": "电影",
        "parent": 0,
        "desc": "电影"
    },
    "83": {
        "name": "其他国家",
        "parent": 23,
        "desc": ""
    },
    "145": {
        "name": "欧美电影",
        "parent": 23,
        "desc": ""
    },
    "146": {
        "name": "日本电影",
        "parent": 23,
        "desc": ""
    },
    "147": {
        "name": "国产电影",
        "parent": 23,
        "desc": ""
    },
    "202": {
        "name": "资讯",
        "parent": 0,
        "desc": ""
    },
    "203": {
        "name": "热点",
        "parent": 202,
        "desc": ""
    },
    "204": {
        "name": "环球",
        "parent": 202,
        "desc": ""
    },
    "205": {
        "name": "社会",
        "parent": 202,
        "desc": ""
    },
    "206": {
        "name": "综合",
        "parent": 202,
        "desc": ""
    }
}